mccwong/micropython/ports/esp32/boards/mw/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "mw"    // 4MB/OTA with spiram (maurice)
#define MICROPY_HW_MCU_NAME "ESP32"
